cause_mapping_list <- list(
  # 不專心
  Distraction = c(
    "起步時未注意安全",
    "恍神、緊張、心不在焉分心駕駛",
    "觀看其他事故、活動、道路環境或車外資訊分心駕駛",
    "飲食、抽(點)菸、拿(撿)物品分心駕駛",
    "穿越道路未注意左右來車",
    "橫越道路不慎",
    "乘客、車上動(生)物干擾分心駕駛",
    "操作、觀看行車輔助或娛樂性顯示設備",
    "使用手持行動電話"
  ),

  # 錯誤決策
  Decision = c(
    "違反閃光號誌",
    "車輛未依規定暫停讓行人先行",
    "其他不當駕車行為",
    "闖紅燈左轉(或迴轉)",
    "闖紅燈直行",
    "無號誌路口，轉彎車未讓直行車先行",
    "左轉彎未依規定",
    "逆向行駛",
    "無號誌路口，左方車未讓右方車先行",
    "右轉彎未依規定",
    "未依標誌或標線穿越道路",
    "未依規定減速",
    "閃避不當(慎)",
    "有號誌路口，轉彎車未讓直行車先行",
    "違反禁止超車標誌(線)",
    "變換車道不當",
    "倒車未依規定",
    "違反二段式左(右)轉標誌(線)",
    "無號誌路口，支線道未讓幹線道先行",
    "其他未依規定讓車",
    "未保持行車安全間隔",
    "未保持行車安全距離",
    "違反其他標誌(線)禁制",
    "迴轉未依規定",
    "未依號誌或手勢指揮(示)穿越道路",
    "超速駕駛",
    "違反其他號誌",
    "無號誌路口，少線道未讓多線道先行",
    "違規超車",
    "闖紅燈右轉",
    "違反禁止左轉、右轉標誌",
    "未避讓緊急任務車輛",
    "未避讓(跟隨、併駛、超車)消防、救護、警備、工程救險車、毒性化學物質災害事故應變車等執行緊急任務車",
    "未靠右行駛",
    "違反禁止變換車道標線",
    "爭(搶)道行駛",
    "未依規定行走地下道、天橋穿越道路",
    "多車道迴轉，未先駛入內側車道",
    "違反車輛專用標誌(線)",
    "違反遵行方向標誌(線)",
    "未依規定使用燈光",
    "違反禁止迴轉或迴車標誌",
    "行經圓環未依規定讓車",
    "未遵守依法令授權交通指揮人員之指揮",
    "山路會車，靠山壁車未讓外緣車先行",
    "違反行人專用標誌(線)",
    "違反車輛改道標誌",
    "違反禁止會車標誌",
    "車輛或機械操作不當(慎)",
    "方向不定(不包括危險駕車)",
    "搶(闖)越平交道",
    "違反禁行車種標誌(字)",
    "違反禁止進入標誌",
    "違反禁止各種車輛進入標誌"
  ),

  # 違規姿態 / 停車
  Posture = c(
    "違規(臨時)停車",
    "開啟或關閉車門不當",
    "未待乘客安全上下而開車",
    "車輛拋錨未採安全措施",
    "發生事故後，未採取安全措施",
    "暗處停車無燈光、標識",
    "車輛未停妥滑動致生事故",
    "停車操作時未注意安全",
    "上下車輛時未注意安全",
    "未待車輛停妥而上下車"
  ),

  # 酒駕 / 疲勞
  Driver_Impairment = c(
    "患病或服用藥物(疲勞)駕駛",
    "酒醉(後)駕駛",
    "打瞌睡或疲勞駕駛",
    "吸食違禁物駕駛",
    "打瞌睡或疲勞駕駛(包括連續駕車8小時)"
  ),

  # 其他
  Other = c(
    "在道路上嬉戲或奔走不定",
    "其他引起事故之疏失或行為",
    "峻狹坡路會車，下坡車未讓上坡車先行",
    "使用車輛自動駕駛或先進駕駛輔助系統設備(裝置)不符規定",
    "使用自動駕駛或先進駕駛輔助系統設備不符規定",
    "乘坐不當(慎)",
    "危險駕駛"
  ),

  # 車輛
  Vehicle = c(
    "車輪脫落或輪胎爆裂",
    "車輛零件脫落",
    "其他機件失靈或故障",
    "煞車失靈或故障",
    "裝載貨物不穩妥",
    "裝載未盡安全措施",
    "物品滾(滑行)或飛(掉)落",
    "車輛附屬機具或車門未盡安全措施",
    "方向操縱系統故障",
    "超載人員",
    "載運貨物超重",
    "裝卸貨物不當",
    "其他裝載不當",
    "燈光系統故障",
    "載運貨物超長、寬、高",
    "夜間行駛無燈光設備"
  ),

  # 環境
  Environmental = c(
    "在道路上工作之人員未設適當標識",
    "因光線、視線遮蔽致生事故",
    "道路設施、植栽或其他裝置倒塌或掉落",
    "施工安全防護措施未完善",
    "平交道看守疏失或未放柵欄",
    "強風、暴雨、濃霧(煙)",
    "動物竄出",
    "路況危險無安全(警告)設施",
    "未依法令授權指揮交通或指揮不當",
    "道路設施(備)、植栽或其他裝置，倒塌或掉(斷)落",
    "物品(件)滾(滑行)或飛(掉)落",
    "其他交通管制不當",
    "施工安全防護措施未依規定或未盡完善(備)"
  ),

  # 未發現 / 不明
  Unidentified = c(
    "尚未發現肇事因素",
    "相關跡證不足且無具體影像紀錄",
    "肇事逃逸未查獲，無法查明肇因",
    "事故發生時當事者逕自離開現場",
    "被車輛輾壓之不明物體彈飛",
    "相關跡證不足且無具體影像紀錄，當事人各執一詞，經分析後無法釐清肇事原因"
  )
)
